{
  "Background": "A modern urban basketball court in a residential neighborhood during late afternoon. The court has weathered concrete with faded paint lines, chain-link fencing around the perimeter, and a single hoop with a slightly bent rim. The atmosphere is casual and competitive, with the golden hour sun casting long shadows across the court. The setting feels authentic and lived-in, representing countless hours of neighborhood pickup games.",
  "Characters": [
    {
      "Name": "Edward",
      "Description": "17-year-old athletic teenager, 5'10\" with short dark hair, wearing a faded red tank top, black basketball shorts, and worn high-top sneakers. Has a determined expression and moves with confident swagger.",
      "Personality": "Competitive, focused, slightly cocky but good-natured. Quick to trash talk but respects good plays. Natural leader on the court.",
      "Role": "Protagonist"
    },
    {
      "Name": "Michael",
      "Description": "16-year-old lean teenager, 5'8\" with curly brown hair, wearing a white t-shirt, blue shorts, and clean basketball shoes. Has an earnest, concentrated expression and moves with careful precision.",
      "Personality": "Methodical, hardworking, less experienced but eager to prove himself. Quiet but determined, focuses on fundamentals over flashy moves.",
      "Role": "Supporting character/friendly rival"
    }
  ],
  "Scenes": [
    {
      "Scene": 1,
      "Description": "Wide shot of empty basketball court, golden hour lighting, dramatic shadows across weathered concrete, establishing the urban neighborhood setting with chain-link fence visible.",
      "Dialogue": ""
    },
    {
      "Scene": 2,
      "Description": "Medium shot of Edward dribbling confidently toward camera, determined expression, warm afternoon lighting highlighting his athletic form and red tank top.",
      "Dialogue": "Come on Mike, let's see what you got!"
    },
    {
      "Scene": 3,
      "Description": "Close-up of Michael's focused face, sweat glistening, intense concentration as he prepares to defend, soft golden light creating dramatic contrast.",
      "Dialogue": "I'm ready for you, Ed."
    },
    {
      "Scene": 4,
      "Description": "Dynamic medium shot of Edward attempting a crossover dribble, motion blur effect, dramatic side lighting capturing the competitive energy and movement.",
      "Dialogue": ""
    },
    {
      "Scene": 5,
      "Description": "Low-angle shot of Michael successfully stealing the ball, triumphant expression, golden hour backlighting creating silhouette effect, empowering camera angle.",
      "Dialogue": "Got it!"
    },
    {
      "Scene": 6,
      "Description": "Wide shot of Michael driving toward the basket, Edward chasing behind, long shadows stretching across court, cinematic sports photography style.",
      "Dialogue": ""
    },
    {
      "Scene": 7,
      "Description": "Close-up slow motion of basketball swishing through net, dramatic lighting, shallow depth of field, satisfying conclusion to the play sequence.",
      "Dialogue": ""
    },
    {
      "Scene": 8,
      "Description": "Medium shot of both players, Edward patting Michael's shoulder with respect, warm golden light, friendly competitive atmosphere, good sportsmanship displayed.",
      "Dialogue": "Nice shot, man. Good game."
    }
  ]
}
